# GetOrCreateRebarContainerType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerType..::..GetOrCreateRebarContainerType Method
RebarContainerType Class See Also
---
Creates or returns a RebarContainerType object with a given name.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static ElementId GetOrCreateRebarContainerType(
	Document aDoc,
	string name
)
```

Visual Basic
---
```text
Public Shared Function GetOrCreateRebarContainerType ( _
	aDoc As Document, _
	name As String _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetOrCreateRebarContainerType(
	Document^ aDoc,
	String^ name
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
name
    Type: System..::..String Name of the type.
# ### Return Value
The type id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace